// src/data/questions.js

export const questions = [
  {
    id: 1,
    question:
      '"ప్రభువా, నన్ను విడిచి వెళ్ళుము, నేను పాపాత్ముడను" అని యేసుక్రీస్తుతో చెప్పిన శిష్యుడు ఎవరు?',
    options: [
      "మత్తయి",
      "పేతురు",
      "యూదా",
      "తోమా",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 2,
    question:
      '"యేసు క్రీస్తువారు జబ్బుపడిన వారిని స్వస్తపరిచినప్పుడు వారిలో దేనిని చూసి వారికి స్వస్తపరిచారు..?"',
    options: [
      "భక్తి",
      "విధేయత",
      "ప్రేమ",
      "విశ్వాసం",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 3,
    question:
      '"రోగులకే గాని ఆరోగ్యముగలవారికి వైధ్యుడక్కరలేదు." పై వాక్యంలో "రోగులు" అనే పదం ఎవరికి సాదృశ్యం?',
    options: [
      "పరిశుద్దులుకు",
      "పాపులకు",
      "నీతిమంతులకు",
      "దర్శపరులకు",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 4,
    question:
      "స్త్రీలు కనినవారిలో _________ కంటే గొప్పవాడెవడును లేడు.",
    options: [
      "దావీదు",
      "మోషే",
      "యోహాను",
      "అబ్రాహాము",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 5,
    question:
      '"ఇదిగో వీడు తిండిపోతును మద్యపానియు, సుంకరులను, పాపులకును స్నేహితుడును" అని ఎవరి గురించి చెప్తున్నారు.',
    options: [
      "యోహాను గురించి",
      "మనుష్యకుమారుడు గురించి",
      "మత్తయి గురించి",
      "పేతురు గురించి",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 6,
    question:
      'మీరు నేను ఎవడినని చెప్పుకొనుచున్నారు అని వారిని అడుగగా శిష్యుడు - "నీవు దేవుని క్రీస్తువనెను" పై వాక్యంలో ఆ శిష్యుడు ఎవరు?',
    options: [
      "మత్తయి",
      "ఆంధ్రేయ",
      "పేతురు",
      "యాకోబు",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 7,
    question:
      "తన________ను రక్షించుకోన గోరువాడు దానిని పోగొట్టుకోనును నా నిమిత్తమై తన________ పోగొట్టుకోను వాడు దానిని రక్షించుకోనును.",
    options: [
      "ధనమును",
      "కీర్తిని",
      "శరీరంను",
      "ప్రాణమును",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 8,
    question:
      "పేతురు ప్రభువుతో మూడు పర్ణశాలలు మేము కట్టుదుమని చెప్పాడు కదా ఆ మూడు పర్ణశాలలు ఏ ముగ్గురికి కట్టుదుమని చెప్పాడు.?",
    options: [
      "క్రీస్తుకు, మోషేకు, సోలోమోనుకు",
      "మోషేకు, దావీదుకు, అబ్రాహాముకు",
      "క్రీస్తుకు, ఏలియాకు, అబ్రాహాముకు",
      "క్రీస్తుకు, మోషేకు, ఏలియాకు",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 9,
    question:
      "నాగటి మీద చెయ్యిపెట్టి వెనుతట్టు చూచి వాడెవడును దేవుని________కు పాత్రుడుకాడని వానితో చెప్పెను.",
    options: [
      "ఆశీర్వాదమునకు",
      "రాజ్యమునకు",
      "కీర్తికి",
      "సంపదకు",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 10,
    question:
      "ఏలీయాయొక్క ఆత్మయు శక్తియు గలవాడు అని ఎవరి గురించి రాయబడివుంది?",
    options: [
      "పౌలుగారి గురించి",
      "పేతురు గురించి",
      "క్రీస్తు గురించి",
      "బాప్తిస్మమిచ్చు యోహాను గురించి",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 11,
    question:
      'గాబ్రియేలు దూత "మరియకు" ప్రత్యక్షమై తనకి క్రీస్తు పుడతాడు అని చెప్పేసరికి "ఎలీసబెతు ఎన్నవ మాసము?"',
    options: [
      "7వ మాసము",
      "6వ మాసము",
      "5వ మాసము",
      "4వ మాసము",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 12,
    question:
      "ఇశ్రాయేలీయులు తమకు పుట్టిన పిల్లలకు వారు పుట్టిన తరువాత ఎన్నవ రోజున వారికి సున్నతి చేస్తారు?",
    options: [
      "8వ దినమున",
      "6వ దినమున",
      "5వ దినమున",
      "4వ దినమున",
    ],
    answer: 0,
    difficulty: "Easy",
  },

  {
    id: 13,
    question: `Match the following:

1. ______ మీరు ధన్యులు దేవుని రాజ్యము మీది
   a) ఆకలిగొనుచున్న

2. ______ మీరు ధన్యులు మీరు తృప్తి పరచబడుదురు.
   b) ఏడ్చుచున్న

3. ______ మీరు ధన్యులు మీరు నవ్వుదురు
   c) బీదలైన.`,

    options: [
      "1. 1(b) 2(c) 3(a)",
      "2. 1(c) 2(b) 3(a)",
      "3. 1(a) 2(b) 3(c)",
      "4. 1(c) 2(a) 3(b)",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 14,
    question: `Match the following:

1. మీ శత్రువులను
   a) ప్రేమించుడి

2. మిమ్మును ద్వేషించు వారికి
   b) దీవించుడి

3. మిమ్మును శపించువారిని
   c) మేలు చేయుడి

4. మిమ్మును బాధించువారి కొరకు
   d) ప్రార్ధన చేయుడి.`,

    options: [
      "1. 1(a) 2(b) 3(d) 4(c)",
      "2. 1(b) 2(a) 3(c) 4(d)",
      "3. 1(c) 2(b) 3(d) 4(a)",
      "4. 1(a) 2(c) 3(b) 4(d)",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 15,
    question:
      '"మరి కొన్ని ముండ్లపొదల నడుమ పడెను; ముండ్లపొదలు వాటితో మొలిచి వాటిని అణచివేసెను." (పై వాక్యానికి సంబంధించిన సరియైన భావాన్ని గుర్తించండి).',
    options: [
      "వారు వినువారు గాని నమ్మి రక్షణ పొందకుండునట్లు అపవాది వారి హృదయములో నుండి వాక్యమేతికొని పోవును.",
      "వాక్యమును సంతోషముగా అంగీకరించువారు గాని వేరు లేనందున కొంచెము కాలము శోధనకాలమున తొలగిపోవుదురు.",
      "ఈ జీవసంబంధమైన విచారముల చేతను దానబోగములచేతను అణచివేయబడి పరిపక్వముగా ఫలింపనివారు.",
      "యోగ్యమైన మంచి మనస్సుతో వాక్యము విని దానిని అవలంబించి ఓపికతో ఫలించువారు.",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 16,
    question:
      "యాయూరు కుమార్తె చనిపోయినప్పుడు ప్రభువు తనని బ్రతికించడానికి వెళ్తూ తనతో పాటు తీసుకు వెళ్ళిన శిష్యులు ఎవరు?",
    options: [
      "ఆంధ్రేయ, పేతురు, పిలిప్పు",
      "పేతురు, యోహాను, యాకోబు",
      "యాకోబు, ఆంధ్రేయ, పిలిప్పు",
      "యోహాను, పేతురు, పిలిప్పు",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 17,
    question:
      "మీ అందరిలో ఎవడు ______ యుండునో వాడే గొప్పవాడని వాడితో చెప్పెను.",
    options: [
      "దీనుడై",
      "అల్పుడై",
      "అత్యల్పుడై",
      "ప్రేమగలవాడై",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 18,
    question:
      'నినువలె నీ పొరుగువారిని ప్రేమింపవలెనని వ్రాయబడియున్న ఈ ఆజ్ఞాలో - "నా పొరుగువాడు ఎవడని" యేసునడిగిన వ్యక్తి ఎవరు?',
    options: [
      "పరిసయ్యుడు",
      "శిష్యులు",
      "సద్దూకయ్యడు",
      "ధర్మశాస్త్రాపదేశకుడు",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 19,
    question:
      "యాజకుడైన జెకర్యా ఏ తరగతికి సంబంధిన వాడు?",
    options: [
      "యెహోయారాబు",
      "యెదాయా",
      "హరాము",
      "అబీయా",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 20,
    question:
      "జెకర్యాకు దేవుడు పంపిన సువార్తమానము తెలుపుటకు వచ్చిన దూత ఎవరు?",
    options: [
      "మిఖాయేలు",
      "గబ్రియేలు",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 21,
    question:
      "ఆయన ___________ వంశస్థులను యుగయుగములు ఏలును.",
    options: [
      "అబ్రాహాయు వంశం",
      "దావీదు వంశం",
      "యాకిబు వంశం",
      "నోవహు వంశం",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 22,
    question:
      "క్రీస్తును చూడక మునుపు మరణము పొందడని పరిశుద్ధాత్మ చేత బయలు పరచబడిన వ్యక్తి ఎవరు?",
    options: [
      "నికోదేము",
      "సుమెయోను",
      "యోహను",
      "జెకర్యా",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 23,
    question:
      'యోహాను - "మీకు నిర్ణయింపబడినదాని కంటే ఎక్కువ తీసికొనవద్దని" ఎవరితో చెప్పెను?',
    options: [
      "శాస్త్రులకి",
      "పరిసయ్యులకి",
      "సుంకరులకి",
      "సైనికులకు",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 24,
    question:
      "ప్రభువు ఆత్మ నా మీద ఉన్నది బీదలకు సువార్త ప్రకటించుటకై ఆయన నన్ను అభిషేకించెను. పై ఉన్న వాక్యం క్రీస్తు గురించి చెప్పబడింది. ఏ ప్రవక్త దీనిని చెప్పారు?",
    options: [
      "యిర్మీయా",
      "యెషయా",
      "దానియేలు",
      "యెహెజ్కేలు",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 25,
    question:
      "రోగులకే గాని ఆరోగ్యముగల వారికి వైద్యుడక్కరలేదు. (ఏ అధ్యాయములో పై వాక్యం ఉంది?)",
    options: [
      "3 అధ్యాయము",
      "4 అధ్యాయము",
      "5 అధ్యాయము",
      "6 అధ్యాయము",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 26,
    question: `ప్రతి చెట్టు తన ఫలముల వలన తెలియబడును.
ముండ్ల పొదలో______ పండ్లు ఏరుకొనరు
కొరింథ పొదలో______ పండ్లు కోయరు`,
    options: [
      "ద్రాక్ష, అంజూరపు",
      "దానిమ్మ, ద్రాక్ష",
      "అంజూరపు, ద్రాక్ష",
      "ఒలివ, ద్రాక్ష",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 27,
    question:
      "ఇశ్రయేలులోనైనను ఇంత గొప్ప విశ్వాసము నేను చూడలేదని.... ప్రభువు ఎవరి గురించి చెప్పారు?",
    options: [
      "కనానీయురాలైన (స్త్రీ)",
      "కుష్టురోగి",
      "యాయీరు",
      "శతాధిపతి",
    ],
    answer: 3,
    difficulty: "Easy",
  },

  {
    id: 28,
    question:
      'ఇదిగో నేను నా దూతను నీకు ముందుగా పంపుచున్నాను అతడు నీ ముందర నీ మార్గము సిద్ధపరచును. "ఈ పై వాక్యం ఎవరి గురించి రాయుబడింది?"',
    options: [
      "ఎలీషా",
      "మలాకీ",
      "యెహాను (బాప్తిస్మకర్త)",
      "యెషయా",
    ],
    answer: 2,
    difficulty: "Easy",
  },

  {
    id: 29,
    question:
      "బైబిల్ గ్రంథములో ఎన్ని పుస్తకాలు ఉన్నాయి?",
    options: [
      "56",
      "66",
      "76",
      "77",
    ],
    answer: 1,
    difficulty: "Easy",
  },

  {
    id: 30,
    question:
      "పాతనిబంధనకు, క్రొత్త నిబంధనకు మధ్య సమయం ఎంత?",
    options: [
      "430",
      "365",
      "400",
      "70",
    ],
    answer: 2,
    difficulty: "Easy",
  },
];