// src/data/questions.js

export const questions = [
  {
    id: 1,
    question: "మొదట దేవుడు ఏమి సృష్టించాడు?",
    options: [
      "ఆకాశమును మరియు భూమిని.",
      "నక్షత్రాలు",
      "భూమి,నీరు",
      "సూర్య, చంద్రులు"
    ],
    answer: 0,
    difficulty: "Easy"
  },

  {
    id: 2,
    question: "భూమి మొదట ఎలా ఉండేది?",
    options: [
      "మంచిగా",
      "చీకటిగా",
      "వెలుగుగా",
      "నిరాకారముగాను, శూన్యముగాను ఉండెను."
    ],
    answer: 3,
    difficulty: "Easy"
  },

  {
    id: 3,
    question: "దేవుని ఆత్మ ఎక్కడ అల్లాడుచుండెను?",
    options: [
      "ఆకాశములో",
      "భూమ్యాకాశముల మధ్యలో",
      "జలముల మీద అల్లాడుచుండెను.",
      "చీకటిలో బిలములో"
    ],
    answer: 2,
    difficulty: "Easy"
  },

  {
    id: 4,
    question: "దేవుడు మొదటి రోజున ఏమి సృష్టించాడు?",
    options: [
      "చీకటిని",
      "నీరుని",
      "వెలుగును.",
      "వెలుగు చీకటి"
    ],
    answer: 2,
    difficulty: "Easy"
  },

  {
    id: 5,
    question: "దేవుడు వెలుగుకు ఏమని పేరు పెట్టాడు?",
    options: [
      "ఒకరోజు",
      "చీకటి,పగలు",
      "రాత్రి",
      "పగలు."
    ],
    answer: 3,
    difficulty: "Easy"
  }
];